Revit 2024 API
RebarContainerIterator.MoveNext Method
 Increments the iterator to the next item.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public virtual bool MoveNext()
Visual Basic
Public Overridable Function MoveNext As Boolean
Visual C++
public:
virtual bool MoveNext()
Return Value
 True if there is a next available item in this iterator. False if the iterator has completed all available items.
Remarks
 After an enumerator is created or after the Reset method is called, an enumerator is positioned before the first element of the collection, and the first call to the MoveNext method moves the enumerator over the first element of the collection.
See Also
RebarContainerIterator Class
Autodesk.Revit.DB.Structure Namespace